Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: གླུ་དང་གར་དང་རོལ་མོའི་དགའ་བས་མྱོས་པ་དང་། འདོད་པའི་ཡོན་ཏན་ལ་དགའ་ཞིང་། བརྩོན་པ་རྣམས་ལ་སྐྱེ་བ་དང་། རྒ་ཤི་དང་། གཏི་མུག་གི་མུན་པ་ཆེན་པོས་འཇིགས་པའི་གཉེན་པོར་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྐྱེད་པའི་ཕྱིར།
en: “Moreover, noble one, to the young men and women in the prime of life who are intoxicated by youthfulness, intoxicated by the delights of singing, dancing, and music, who are dedicated to delighting in sensory pleasures, to them I praise dedication to creating roots of merit as a remedy for the fear of birth, old age, death, and the great darkness of ignorance.

source: བརྩོན་འགྲུས་ཀྱི་ལེགས་པས་བསྔགས་པ་བྱེད་དོ། །སེམས་ཅན་སེར་སྣ་དང་ལྡན་པ་རྣམས་ནི་སྦྱིན་པ་ལ་རབ་ཏུ་སྦྱོར་རོ། །
en: I bring beings who are miserly to the practice of generosity.

source: སེམས་ཅན་ཚུལ་ཁྲིམས་ངན་པ་ཅན་རྣམས་ནི། ཚུལ་ཁྲིམས་ལ་རབ་ཏུ་འགོད་དོ། །
en: I bring beings who have bad conduct to the practice of correct conduct.

source: ངན་སེམས་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་ལ་ནི། བྱམས་པའི་ལེགས་པ་བརྗོད་པར་བྱེད་དོ། །
en: I praise love to beings who have malicious minds.

source: སེམས་འཁྲུགས་པའི་སེམས་ཅན་རྣམས་ནི་བཟོད་པ་ལ་རབ་ཏུ་འགོད་དོ། །
en: I establish beings with disturbed minds in the practice of patience.

source: ལེ་ལོ་ཅན་གྱི་སེམས་ཅན་རྣམས་ནི། བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་བརྩམ་པ་ལ་རབ་ཏུ་འགོད་དོ། །
en: I establish beings who are lazy in the practice of undertaking bodhisattva diligence.

source: སེམས་ཅན་རྣམ་པར་མྱོས་པའི་སེམས་ཅན་རྣམས་ནི་བསམ་གཏན་ལ་རབ་ཏུ་འགོད་དོ། །
en: I establish beings who have intoxicated minds in the practice of dhyāna.

source: ཤེས་རབ་འཆལ་བ་ཅན་གྱི་སེམས་ཅན་རྣམས་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡོངས་སུ་སྦྱོར་རོ། །
en: I bring beings with poor wisdom to the practice of the perfection of wisdom.

source: ཐེག་པ་དམའ་བ་ལ་མོས་པའི་སེམས་ཅན་རྣམས་ནི་ཐེག་པ་ཆེན་པོ་ལ་རབ་ཏུ་འགོད་དོ། །
en: I establish beings who aspire to the lower yānas in the practice of the Mahāyāna.

source: ཁམས་གསུམ་ལ་མངོན་པར་ཞེན་པའི་སེམས་ཅན་རྣམས་ནི། བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ། སྲིད་པའི་ལམ་གྱི་རྒྱུད་མཐར་ཕྱིན་པའི་དཀྱིལ་འཁོར་ལ་སྤྱོད་པ་ལ་རབ་ཏུ་འགོད་དོ། །
en: I establish beings who have attachment to the three realms in the bodhisattva perfection of prayer, the field of the ultimate conclusion of the paths of existence.

source: དམིགས་པའི་དབང་དུ་གྱུར་པའི་སེམས་ཅན་ལས་དང་། ཉོན་མོངས་པས་རབ་ཏུ་མནར་བ་བསོད་ནམས་དང་། ཡེ་ཤེས་ཀྱི་སྟོབས་མེད་པ་རྣམས་ནི། བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རབ་ཏུ་འགོད་དོ། །
en: I establish in the perfection of bodhisattva strength those beings who are overpowered by their objects of perception, are tormented by karma and kleśas, and have weak merit and wisdom.

source: མི་ཤེས་པའི་མུན་ནག་གིས་ཁེབས་པའི། སེམས་ཅན་བདག་ཏུ་བྱ་བ་དང་། བདག་གིར་བྱ་བས་མ་རིག་པའི་མུན་ནག་ཏུ་འཐོམས་པ་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རབ་ཏུ་འགོད་དེ།
en: I establish in the perfection of bodhisattva knowledge those beings who are overwhelmed by the darkness of ignorance and enveloped in the darkness of believing in a self and possessions.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཁོ་མོ་ནི། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དགའ་བའི་འོད་སྤྲོ་བ་ཡངས་པ་ཡང་དག་པར་འབྱུང་བ་ཐོབ་པའོ། །
en: “Moreover, noble one, I have attained the bodhisattva liberation called the arising of the vast radiating light of joy.”

source: ནོར་བཟངས་ཀྱིས་སྨྲས་པ། ལྷ་མོ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་དགའ་བའི་འོད་སྤྲོ་བ་ཡངས་པ་ཡང་དག་པར་འབྱུང་བ་དེའི་ཡུལ་ཇི་ལྟ་བུ་ཞིག་མཆིས་སྨྲས་པ།
en: Sudhana asked, “Goddess, what is this bodhisattva liberation called the arising of the vast radiating light of joy like?”

source: རིགས་ཀྱི་བུ་རྣམ་པར་ཐར་པ་དེ་ནི། དེ་བཞིན་གཤེགས་པའི་བསོད་ནམས་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྡུད་པའི་ཡེ་ཤེས་དང་། ཐབས་སྣང་བ་དང་ལྡན་པ་སྟེ།
en: She answered, “Noble one, this bodhisattva liberation has the radiance of the knowledge and methods of gathering beings through the merit of the tathāgatas.

source: རིགས་ཀྱི་བུ་སེམས་ཅན་རྣམས་ཀྱི་བདེ་བ་ཉམས་སུ་མྱོང་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པའི་བསོད་ནམས་ཀྱི་མཐུས་བྱུང་བའོ། །དེ་བཞིན་གཤེགས་པའི་གདམས་ངག་གི་ཚུལ་གྱིས་བྱུང་བའོ། །དེ་བཞིན་གཤེགས་པའི་གསུང་ལ་ནན་ཏན་ཏུ་བྱས་པས་བྱུང་བའོ། །དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་བསླབས་པས་བྱུང་བའོ། །དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བྱུང་བའོ། །དེ་བཞིན་གཤེགས་པས་བསྟན་པའི་ལམ་ལ་ནན་ཏན་དུ་བྱས་པས་བྱུང་བའོ། །
en: “Noble one, it is because all happiness that beings experience occurs through the power of the merit of the tathāgatas, through the path of instruction of the tathāgatas, through practicing the words of the tathāgatas, through following the example of the tathāgatas, through the blessing of the tathāgatas, through practicing the path taught by the tathāgatas, through creating roots of merit in the same way the tathāgatas have, through the power of the natural result of the Dharma that is taught by the tathāgatas, and through illumination from the sun of the wisdom of the tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་དང་ཚུལ་འདྲ་བའི་དགེ་བའི་རྩ་བ་བསྐྱེད་པས་བྱུང་བའོ། །དེ་བཞིན་གཤེགས་པས་ཆོས་བསྟན་པའི་མཐུན་པའི་རྒྱུས་བྱུང་བའོ། །དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་ཉི་མ་སྣང་བས་བྱུང་བའོ། །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་ཆོས་དཀར་པོའི་དཀྱིལ་འཁོར་གྱི་སྣང་བས་ནི། སེམས་ཅན་རྣམས་ཀྱི་བདེ་བ་ཡོངས་སུ་འབྱུང་སྟེ།
en: “Noble one, the happiness of beings arises from the light of the disk of good qualities of the family of the tathāgatas.

source: འདི་ལྟར་རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དགའ་བའི་འོད་སྤྲོ་བ་ཡངས་པ་ཡང་དག་པར་འབྱུང་བ་འདི་ལ་འཇུག་པའི་ཚེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྔོན་གྱི། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་མཚོ་རྗེས་སུ་དྲན་པར་བྱེད་ཅིང་འཇུག་པ་དང་། ཁོང་དུ་ཆུད་པར་བྱེད་པའི་ཚེ། འདི་ལྟར་བཅོམ་ལྡན་འདས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་བཞུགས་པས། སེམས་ཅན་བདག་ཏུ་བྱ་བ་དང་། བདག་གིར་བྱ་བ་ལ་མངོན་པར་ཞེན་པ།
en: “Noble one, it is like this: I realized this bodhisattva liberation called the arising of the vast radiating light of joy when I remembered, comprehended, and understood the ocean of the past bodhisattva conduct of the Bhagavat Tathāgata Arhat Samyak­saṃbuddha Vairocana.

source: མ་རིག་པའི་མུན་པས་འཐོམས་པ། ལྟ་བའི་ཐིབས་པོའི་ལྟ་བས་དགོན་པར་འཁྱམས་པ། སྲིད་པའི་དབང་དུ་གྱུར་པ། འདོད་ཆགས་ཀྱི་བཅིངས་པས་གླགས་པ། ཞེ་སྡང་གིས་ཁོང་ཁྲོ་བའི་སེམས་དང་ལྡན་པ། གཏི་མུག་གིས་སེམས་ཀྱི་རྒྱུད་འཁྲུགས་པར་གྱུར་པ། ཕྲག་དོག་དང་སེར་སྣས་ཀུན་ནས་འཁོར་བ། ཉོན་མོངས་པས་རབ་ཏུ་དཀྲུགས་པའི་སེམས་དང་ལྡན་པ། འཁོར་བའི་སྡུག་བསྔལ་ཆེན་པོ་ཉམས་སུ་མྱོང་བར་གྱུར་པ། འཁོར་བ་ན་འཕོངས་པའི་སྡུག་བསྔལ་གྱིས་རབ་ཏུ་གཟིར་བ། སངས་རྒྱས་བལྟ་བ་ལས་ཕྱིར་ཕྱོགས་པར་གྱུར་པ། ཐམས་ཅད་གཟིགས་ནས་ཐུགས་རྗེ་ཆེན་པོའི་དགོངས་པ་སྐྱེས་པར་གྱུར་ཏོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་འགྲོ་བ་ཐམས་ཅད་ལ་ཡོ་བྱད་དང་། རིན་པོ་ཆེ་ཡོངས་སུ་བསྡུ་ཞིང་། ཡོངས་སུ་སྡུད་པའི་དགོངས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཁོ་བའི་ཡོ་བྱད་ཡོངས་སུ་བསྒྲུབ་པའི་དགོངས་པ་དང་། དངོས་པོ་ཐམས་ཅད་ལ་ཆགས་པ་མི་མངའ་བའི་དགོངས་པ་དང་། ཡུལ་ཐམས་ཅད་ལ་ཡེ་བརྔམ་པ་མི་མངའ་བའི་དགོངས་པ་དང་།
en: “When, in the past, the Bhagavat was on the bodhisattva bhūmis, he developed a motivation of great compassion on seeing beings with the belief in a self, with the belief in possessions, enveloped in the darkness of ignorance, wandering in the wilderness of thickets of wrong views, under the power of craving, imprisoned within the bondage of desire, having thoughts of hatred caused by anger, with their minds disturbed by ignorance, ensnared by jealousy and greed, with their minds disturbed by kleśas, experiencing great suffering in saṃsāra, afflicted by the suffering of poverty in saṃsāra, and having turned away from the sight of a buddha.

source: དགའ་བ་ཐམས་ཅད་ལ་ཆགས་པ་མི་མངའ་བའི་དགོངས་པ་དང་། ལོངས་སྤྱོད་ཐམས་ཅད་ལ་ཡོངས་སུ་མ་ཞེན་པའི་དགོངས་པ་དང་། སྦྱིན་པ་ཐམས་ཅད་ལ་རྣམ་པར་སྨིན་པ་ལ་རེ་བ་མེད་པའི་དགོངས་པ་དང་། འཇིག་རྟེན་གྱི་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ལ་བཞེད་པ་མི་མངའ་བའི་དགོངས་པ་དང་། རྒྱུ་དང་རྐྱེན་ལ་མ་རྨོངས་པའི་དགོངས་པ་དང་། ལེགས་པར་འཚལ་བའི་ཆོས་ལ་ཡང་དག་པར་ཇི་ལྟར་བ་བཞིན་དུ་མཁྱེན་པའི་དགོངས་པ་དང་།
en: “He developed a motivation to benefit all beings through the accumulation and possession of precious requisites in the world, a motivation to produce necessary requisites for all beings, a motivation that was without attachment to anything, a motivation that had no yearning for anything in the entire field of perceptions, a motivation that had no clinging to any pleasure, a motivation that had no longing for any enjoyment, a motivation that had no wish for results ripening from generosity, a motivation that had no longing for any worldly prosperity, a motivation that was not oblivious of causes and conditions, a motivation that had the understanding of the Dharma that was being sought, and a motivation that had attained dedication to the benefit of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་ལ་གཞོལ་བར་བྱ་བ་མངོན་པར་བསྒྲུབ་པའི་དགོངས་པ་ཡང་དག་པར་སྐྱེས་པར་གྱུར་ཏེ།
en: “In that way, he had a mind that understood the nature of all phenomena, the realization of the impartiality of great love toward all realms of beings.

source: དེ་དེ་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ལ་ཡང་དག་པར་ཞུགས་པའི་དགོངས་པ་དང་ལྡན་པ་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་དུ་བྱམས་པ་ཆེན་པོས་སྙོམས་པར་ཞུགས་པ་འགྲོ་བ་ཐམས་ཅད་ཐུགས་རྗེ་ཆེན་པོའི་སྤྲིན་གྱིས་རྒྱས་པར་དགང་བའི་སྦྱོར་བ་མངའ་བ་སེམས་ཅན་གྱི་འཇིག་རྟེན་ཐམས་ཅད་ཀུན་ནས་ཁེབས་པའི་ཆོས་ཀྱི་གདུགས་ཆེན་པོའི་དཀྱིལ་འཁོར་མངའ་བ།
en: He had the activity of spreading clouds of great compassion over all worlds of beings. He possessed a great round parasol of the Dharma that sheltered all worlds of beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་རི་རྣམ་པར་འཇོམས་པའི་ཡེ་ཤེས་རྡོ་རྗེའི་མཚོན་ཆ་མངའ་བ།
en: He possessed the thunderbolt weapon of great wisdom that destroys the mountains of obscurations of all beings.

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་བདེ་བ་ཡོངས་སུ་བསྒྲུབ་པས་དགྱེས་པའི་ཤུགས་རྣམ་པར་འཕེལ་བའི་དགོངས་པ་མངའ་བ།
en: His mind had the increasing power of contentment through bringing happiness to all beings.

source: སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བ་ཕུལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པའི་སྨོན་ལམ་གྱི་དགོངས་པ་མངའ་བ། བསམ་པ་དང་སྨོན་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་ནོར་གྱི་ཆར་རབ་ཏུ་དབབ་པའི་དགོངས་པ་མངའ་བ།
en: His mind prayed that all beings would attain the ultimate happiness; he intended to send down a rain of wealth on all beings in accordance with their wishes and aspirations.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་ཞིང་སྙོམས་པར་སྦྱོར་བའི་དགོངས་པ་མངའ་བ།
en: His mind never abandoned beings but was focused on them all equally.

source: འཕགས་པའི་ནོར་གྱིས་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་མཛད་པའི་དགོངས་པ་མངའ་བ།
en: He intended to satisfy all beings with the wealth of the āryas.

source: སྟོབས་བཅུའི་ཡེ་ཤེས་རིན་པོ་ཆེ་ཕུལ་དུ་དྲི་མ་མེད་པ་ཐོབ་པར་མཛད་པའི་དགོངས་པ་མངའ་བ།
en: He intended that they attain the supreme, stainless, precious knowledge of the ten strengths.

source: བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་ཆེན་པོའི་སྟོབས་དང་ཤུགས་རབ་ཏུ་བརྙེས་པ་དེ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་ཀྱི་སྤྲིན་ཆེན་པོས་སེམས་ཅན་ཀྱི་ཁམས་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ་ནམ་མཁའི་མཐས་གཏུགས་པ་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ།
en: He had attained the strength of the higher cognitions of a bodhisattva. He filled the entirety of the realms of beings and the vast realm of phenomena, as far as space extends, with great clouds of various miraculous bodhisattva manifestations.

source: སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་པར་གྱུར་པར་བཞུགས་ཤིང་སྦྱིན་པའི་དམིགས་པ་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་ཆར་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་དུ་དབབ་པ་དང་།
en: He manifested his presence before all beings and sent down a gift of great rain from a cloud of every form and every kind of object of perception.

source: རིན་པོ་ཆེའི་རྒྱན་ཐམས་ཅད་ཀྱི་སྤྲིན་ཆེན་པོའི་ཆར་མངོན་པར་འབེབས་པ་མཛད་དེ།
en: He sent down rain from a great cloud of every kind of precious jewelry.

source: འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་སོ་སོའི་ཚུལ་དང་ཇི་ལྟར་མཐུན་པས་ལོངས་སྤྱོད་པར་བྱ་བའི་ཕྱིར་དངོས་པོ་རྣམ་པ་ཐ་དད་པ་མཐའ་ཡས་པ་ཡོངས་སུ་གཏང་བ་དང་ཡོ་བྱད་རྣམ་པ་ཐ་དད་པ་ཚད་མེད་པ་ལ་སྤྱད་པར་བྱ་བ་དང་སྦྱིན་པ་རྣམ་པ་སྣ་ཚོགས་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བསྡུ་བའི་ཚུལ་དང་། དངོས་པོ་ཡོངས་སུ་གཏང་བ་རྣམ་པ་དུ་མ་ལ་ཡོངས་སུ་སྤྱད་པ་དང་། ཡོ་བྱད་ཀྱི་རྣམ་པ་དང་། རྒྱན་གྱི་འདུ་བྱེད་བརྗོད་དུ་མེད་པ་དང་། སྦྱིན་པའི་ཚོགས་རྣམ་པ་སྣ་ཚོགས་མཚན་ཉིད་སྣ་ཚོགས་དང་ལྡན་པ།
en: “In that way, so that all beings could have enjoyment according to their own kind, he accomplished giving infinite, different kinds of things, practiced countless different kinds of assistance, engaged in accumulating all the many various kinds of gifts, practiced the conduct of giving away a numerous variety of things, produced an indescribable array of different kinds of requisites, and realized the way of infinite generosity that satisfies beings according to their aspirations with an accumulation of various gifts with various characteristics.

source: སེམས་ཅན་རྣམས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཚིམ་པར་བྱ་བའི་སྦྱིན་པའི་ཚུལ་མཐའ་ཡས་པ་ཐུགས་སུ་ཆུད་པས་སེམས་ཅན་གྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཚིམ་པར་བྱ་བར་མངོན་པར་བསྒྲུབ་པའི་དངོས་པོ་ཐམས་ཅད་གཏང་བ་དང་། ཡོངས་སུ་གཏང་བ་དང་།
en: “Thus he gave, conferred, and bestowed all the things that would bring contentment to beings according to their aspirations.

source: སྦྱིན་པར་བྱ་བ་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་འདུ་བྱེད་ཀྱི་སྡུག་བསྔལ་རྒྱུན་མི་ཆད་པ་ལས་ཡོངས་སུ་བསྐྱབ་པའི་ཚུལ་དུ་བྱ་བ་རྣམས།
en: He engaged in saving all beings from continuous composite suffering.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ལན་ལ་རེ་བ་མི་མངའ་བ་དང་།
en: He had no wish for any being to repay his kindness.

source: འགྲོ་བ་ཐམས་ཅད་ལ་མཉམ་པ་ཉིད་དུ་བྱུང་བའི་དགོངས་པ་མངའ་བས། འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་རིན་པོ་ཆེ་ཡོངས་སུ་སྦྱོང་བ་མཛད་ཅིང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་རྒྱ་མཚོ་གཅིག་ཏུ་གྱུར་པ་ལས་བྱུང་བའི་ཡོངས་སུ་བསྡུ་བའི་ཚུལ། འགྲོ་བ་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོ་བྱད་ཀྱི་ཆར་དབབ་པ། འགྲོ་བ་ཐམས་ཅད་ལ་ཐམས་ཅད་མཁྱེན་པའི་བསོད་ནམས་རྒྱ་མཚོའི་ཤུགས་རྣམ་པར་འཕེལ་བར་མཛད་པས་དགོངས་པའི་སྐད་ཅིག་རེ་རེ་ལ་སེམས་ཅན་མ་ལུས་པ་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་མངོན་པར་བསྒྲུབ་པར་མཛད་པ་དང་། དགོངས་པའི་སྐད་ཅིག་རེ་རེ་ལ་ཞིང་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་མ་ལུས་པ་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཞིང་ཉེ་བར་ཉོན་མོངས་པ་མེད་ཅིང་བླ་ན་མེད་པའི་རྒྱན་རྣམ་པར་དག་པས་རྣམ་པར་ཀླུབ་ཅིང་རབ་ཏུ་བརྒྱན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་། དགོངས་པའི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ལུས་པ་ཐམས་ཅད་རྒྱས་པར་དགང་བ་རྣམ་པར་དག་པར་བྱ་བ་དང་དགོངས་པའི་སྐད་ཅིག་རེ་རེ་ལ་ནམ་མཁའི་དབྱིངས་ཀྱི་གཏོས་མ་ལུས་པ་ཐམས་ཅད་རྒྱས་པར་དགང་བའི་ཡེ་ཤེས་ཀྱི་ཚུལ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་། དགོངས་པའི་སྐད་ཅིག་རེ་རེ་ལ་སེམས་ཅན་དང་དུས་མ་ལུས་པ་ཐམས་ཅད་ལ་འཇུག་ཅིང་ཡེ་ཤེས་ཀྱི་ཚུལ་རྣམ་པར་དག་པར་བྱ་བ་དང་།
en: He possessed the realization of the equality of all beings, so that he purified the precious minds of all beings, and through the methods of gathering beings that have arisen from the roots of merit of all buddhas as a single ocean, he sent down a rain of requisites in accordance with the wishes of all beings, and he increased the power of the ocean of the merit of omniscience for all beings.

source: དགོངས་པའི་སྐད་ཅིག་རེ་རེ་ལ་འགྲོ་བ་མ་ལུས་པ་ཐམས་ཅད་རྣམ་པར་འདུལ་བའི་ཡེ་ཤེས་ཀྱི་ཚུལ་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བ་དང་། དགོངས་པའི་སྐད་ཅིག་རེ་རེ་ལ་དུས་མ་ལུས་པ་ཐམས་ཅད་དུ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ལས་ཕྱིར་མི་ལྡོག་པར་བྱ་བ་དང་། དགོངས་པའི་སྐད་ཅིག་རེ་རེ་ལ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་བྱིན་གྱི་རླབས་ལ་མཁས་པ་མ་ལུས་པར་ཡོངས་སུ་བསྟན་པས་འགྲོ་བ་ཐམས་ཅད་ལ་ཕན་ཐོགས་པར་བྱ་བ་དང་། དགོངས་པའི་སྐད་ཅིག་རེ་རེ་ལ་འཇིག་རྟེན་གྱི་ཁམས་མ་ལུས་པའི་གྲངས་སུ་བྱ་བའི་རྒྱུད་དང་ལྡན་པ། འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་མངོན་པར་བསྟན་པ། འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་ཡོངས་སུ་འདུ་བ། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་སྣ་ཚོགས་བརྗོད་དུ་ཡོད་པ། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་རྣམ་པར་གནས་པ་སྣ་ཚོགས་ཀྱི་མཚམས་རྣམ་པར་བརྒྱན་པ། གཞི་སྣ་ཚོགས་དང་ལྷུན་དུ་མར་བརྗོད་དུ་ཡོད་པ་རྣམ་པར་ཕྱེ་བ་སྣ་ཚོགས་ཀྱི་བསྐལ་པ་རྣམ་པ་ཐ་དད་པ་བསྟན་དུ་ཡོད་པ། ཀུན་ནས་ཉོན་མོངས་ཤིང་རྣམ་པར་དག་པ་དང་རྣམ་པར་དག་ཅིང་ཀུན་ནས་ཉོན་མོངས་པ་དང་།
en: “He accomplished this in order to purify the successive ripening and guiding of all beings without exception in each instant of mind; in order in each instant of mind to cover and adorn the succession of all realms without exception with the pure adornments of the highest, undefiled buddha realms; in order in each instant of mind to pervade and purify the ocean of the ways of all phenomena without exception; in order in each instant of mind to complete the way of wisdom that pervades the entire extent of space without exception; in order in each instant of mind to purify the way of the wisdom that comprehends all beings and times without exception; in order in each instant of mind to attain the illumination of the way of the wisdom that guides all beings without exception; in order in each instant of mind to irreversibly turn the wheel of the Dharma in all times without exception; and in order in each instant of mind to benefit all beings through revealing all skills, without exception, that are the blessing of omniscient wisdom.

source: གཅིག་ཏུ་ཡོངས་སུ་དག་པ་དང་གཅིག་ཏུ་ཀུན་ནས་ཉོན་མོངས་པ་དང་ཆེ་བ་དང་ཡངས་པ་དང་། ཚད་མེད་པ་དང་དོག་པ་དང་ཕྲ་བ་དང་རྒྱ་ཆེ་བ་དང་། གཞི་མཉམ་པ་དང་སྣྲེལ་ཞི་དང་སྤྱིའུ་ཚུགས་དང་། ཕྱོགས་དང་ཕྱོགས་མཚམས་སུ་མངོན་པར་བལྟས་པ་དང་། ཕྱོགས་རྒྱ་མཚོ་སྣ་ཚོགས་སུ་གཞོལ་བ་སྒོ་སྣ་ཚོགས་ནས་བསྟན་ཅིང་སྒོ་མཐའ་ཡས་པའི་དབྱིབས་རྣམ་པ་སྣ་ཚོགས་སུ་འདུག་པའི་རྣམ་པར་ཕྱེ་བ་སྣ་ཚོགས་དང་ལྡན་པའི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་པ་སྤྱད་དེ།
en: “He performed bodhisattva conduct in each instant of mind in all the numbers of world realms without exception; in the arisen ocean of all world realms; in the congregation of the ocean of all world realms; in the vast extent of world realms of various descriptions; within the array of the boundaries of various differentiated families of world realms with boundaries; with descriptions of various bases and masses; in world realms with descriptions of various divisions into kalpas; in world realms that were defiled but also pure, pure but also defiled, entirely pure, and entirely defiled, that were immense, vast, measureless, narrow, minute, and huge, high, level, sideways, upside-down, facing the principal directions and the intermediate directions, and located in the ocean of various directions; and in an array of various shapes and entrances described in various ways.

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ཡོངས་སུ་མནན་ནས། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། རྣམ་པར་འཕྲུལ་པས་རྒྱས་པར་དགང་བར་བྱ་བ་དང་། དགོངས་པའི་སྐད་ཅིག་རེ་རེ་ལ་དུས་གསུམ་གྱི་སངས་རྒྱས་ཀྱི་འཕྲིན་ལས་མ་ལུས་པ་ཐམས་ཅད་སེམས་ཅན་ཕ་རོལ་གྱི་སེམས་དང་བསམ་པས་རྣམ་པར་དམིགས་པར་བྱ་བའི་ཕྱིར་འགྲོ་བ་ཐམས་ཅད་ལ་ཐམས་ཅད་མཁྱེན་པའི་བསོད་ནམས་རྒྱ་མཚོའི་ཤུགས་རྣམ་པར་འཕེལ་བར་མཛད་དེ།
en: “He entered a bodhisattva’s faultlessness in order to spread widely his bodhisattva conduct and miraculous manifestations, in order that in each instant of mind other beings would perceive in their minds and thoughts all the activity of the buddhas of the three times without exception, so that all beings would accomplish increasing the ocean of merit of omniscience.

source: མངོན་པར་བསྒྲུབ་པ་མཛད་པར་གྱུར་པ་མངོན་པར་ཤེས་སོ་རྗེས་སུ་དྲན་ནོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཛད་པའི་ཚེ། འཇིག་རྟེན་གནས་པ་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་དང་བྲལ་བ། སེམས་ཅན་བྱས་པ་དྲིན་དུ་མི་གཟོ་བས་ཡོངས་སུ་གང་བ། མི་ཤེས་པའི་མུན་པས་ཆོད་པ།
en: I know and I remember his accomplishment.

source: བདག་ཏུ་བྱ་བ་དང་། བདག་གིར་བྱ་བ་ལ་མངོན་པར་ཞེན་པ་མ་རིག་པའི་མུན་པ་དང་རབ་རིབ་ཀྱིས་བསྒྲིབས་པ་ཚུལ་བཞིན་མ་ཡིན་པར་རྣམ་པར་རྟོག་པ་ལ་ཞུགས་པ། ལྟ་བའི་ཐིབས་པོའི་བས་དགོན་པར་མགོ་རླག་པ། རྒྱུ་དང་འབྲས་བུ་ལ་མགོ་རྨོངས་པ་ཉོན་མོངས་པ་དང་ལས་ཀྱི་དབང་དུ་གྱུར་པ་འཁོར་བའི་མྱ་ངམ་ཆེན་པོའི་སྡུག་བསྔལ་གྱི་སའི་འོག་ཏུ་ལྟུང་བ། ཕོངས་པའི་སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བར་གྱུར་པ་རྣམས་ལ་ཐུགས་རྗེ་ཆེན་པོ་བསྐྱེད་དེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་སྤྱད་པའི་སྤྲིན་རྒྱ་ཆེན་པོ་མངོན་པར་བསྒྲུབས་ཏེ་དགེ་བའི་རྩ་བ་ལ་བརྟེན་པར་གནས་པ་ཡོངས་སུ་བསྔགས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཁོར་བའི་སྡུག་བསྔལ་རྣམ་པར་བཟློག་པ་དང་། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཆེན་པོ་ལ་མངོན་པར་མོས་པར་བྱ་བ་དང་། རྒྱུའི་དཀྱིལ་འཁོར་གྱི་ཕྱོགས་མངོན་པར་བསྟན་པ་དང་། ལས་དང་ཆོས་སུ་མི་འགལ་བའི་ཕྱོགས་རབ་ཏུ་བརྗོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་བསྡུ་བའི་ཕྱོགས་སྣང་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མོས་པའི་ཕྱོགས་རབ་ཏུ་བརྗོད་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཞིང་ཡོངས་སུ་བསྒྲུབ་པའི་ཕྱོགས་ལེགས་པར་བསྟན་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་མི་གཅད་པའི་ཕྱོགས་ཀྱི་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་།
en: “Noble one, in that way, when the Bhagavat Vairocana was previously practicing bodhisattva conduct, he had compassion for those dwelling in the world, who were devoid of the accumulations of merit and wisdom, who were filled with ingratitude toward other beings, who were enveloped by the darkness of ignorance, who were attached to belief in a self and belief in possessions, who were obscured by the darkness and blindness of ignorance, who had inappropriate thoughts, who were deep in the wilderness of thickets of wrong views, who were ignorant of cause and results, who were under the power of kleśas and karma, who had fallen into the underground world of the great suffering of saṃsāra’s wilderness and were experiencing the various sufferings of poverty.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བསྟན་པའི་ཕྱོགས་ཡོངས་སུ་གཟུང་བ་དང་། མྱི་དགེ་བའི་ཆོས་ཐམས་ཅད་ཀྱི་ཕྱོགས་རྣམ་པར་བཟློག་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་ཀྱི་ཕྱོགས་ཡོངས་སུ་བརྗོད་པ་མཛད་དེ། ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྲིན་ཆེན་པོས་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ། མངོན་པར་བསྒྲུབས་ནས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་ཚིམ་པར་འགྱུར་བར་ཆོས་ཀྱིས་ཤིན་ཏུ་བསྡུ་བ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པར་མཛད་དོ། །
en: “Having compassion for them, he praised establishing strong roots of merit through a vast cloud of the practice of the perfections, dispelled saṃsāra’s suffering of poverty in all beings, inspired them toward a great accumulation of merit and wisdom, elucidated the aspect of the field of causes, explained the aspect of actions that are in accord with the Dharma, illuminated the aspect of understanding the domain of the Buddhadharma, elucidated the aspect of the aspirations of beings, taught the aspect of the creation of the realms of beings, followed the aspect of the uninterrupted family of all the buddhas, held the aspect of the teaching of all the buddhas, dispelled the aspect of all bad qualities, described the aspect of the accumulation of omniscience, and filled all the realms of beings with the great cloud of the perfections.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་ལ་ཡང་དག་པར་བསྐུལ་ཏོ། །བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཆེན་པོ་ལ་རབ་ཏུ་བཙུད་དོ། །འཕགས་པའི་ནོར་ཐམས་ཅད་རབ་ཏུ་ཐོབ་པར་བྱ་བས་ཉེ་བར་བརྟེན་ཏོ། །ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འདུན་པའི་ཤུགས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་རྒྱ་མཚོ་རྣམ་པར་འཕེལ་བར་མཛད་དོ། །
en: Having accomplished that, he satisfied beings in accordance with their aspirations, establishing beings in the compilation of the Dharma; he inspired them toward the accumulation of omniscience; he brought them to the great perfections of a bodhisattva; he increased the ocean of the roots of merit of beings; he strengthened them through the attainment of the wealth of the āryas; and he increased the ocean of the roots of merit of beings through the power of their aspiration for omniscience.

source: དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པའི་སྒོར་ཡང་དེ་དག་རབ་ཏུ་བཙུད་དེ། ཕུང་པོ་ཤིན་ཏུ་ཞི་བའི་བདེ་བས་ཡོངས་སུ་བསྡུ་བས་ཡོངས་སུ་བསྡུས་ཏེ། དེ་བཞིན་གཤེགས་པའི་བདག་ཉིད་ཆེ་བ་ཉིད་ལ་མངོན་དུ་མོས་པར་བྱས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་གཟུང་བའི་ཡེ་ཤེས་ལ་རབ་ཏུ་བཀོད་དོ། །
en: “He brought them to enter the gateways to the miraculous manifestations of the tathāgatas, gathered them through possessing the bliss of the pacification of the skandhas, made them aspire to the greatness that is the nature of the tathāgatas, and established them in the wisdom possessed by the bodhisattvas.”

source: ནོར་བཟངས་ཀྱིས་སྨྲས་པ། འཕགས་མ་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་ནས་ཇི་སྲིད་ཅིག་ལགས། སྨྲས་པ། རིགས་ཀྱི་བུ་གནས་འདི་ནི་ཡིད་ཆེས་པར་དཀའ་བ་སྟེ། ཤེས་པར་དཀའ་བའོ། །
en: Sudhana asked, “Āryā, how long has it been since you entered upon the highest, complete enlightenment?”
